# -*- coding: utf-8 -*-
# @Time : 2022/3/18 13:33
# @Author : Limusen
# @File : 02 元祖

# 元组就是一个“不可变的列表”


# # 1.作用 : 按照索引/位置存放多个值,只用于读不用于改
# 不能改说的是不能够修改元组内部的内存地址

#
# # 2.定义: () 内用逗号分隔开多个任意类型的元素
# t = (1,1.3,"aa",[1],(1,2))
# print(t,type(t))

# x=(19) # 单独一个括号代表包含的意思
# print(x,type(x))
# t = (10,) #如果元祖当中只有一个元素的时候，必须加逗号
# print(t,type(t))

# # t = (1, 1.3, 'aa')  # t=(0->值1的内存地址,1->值1.3的内存地址，2->值'aaa'的内存地址)
#
# t = (1, [11, 22])  # t=(0->值1的内存地址,1->值[11,22]的内存地址）
# t[1][0] = 1111
# print(t)

# # 3.类型转换
#
# print(tuple("hello"))
# print(tuple({"k1": 11, "k2": 22}))
# print(tuple([1, 2, 3, 4, 5]))

# 4.内置方法

# # 优先掌握的操作
#
# # 1.按照索引取值(正向,反向)取值
# t = ("aa", "bb", "cc")
# print(t[0])
# print(t[-1])
#
# # 2.切片
# t = ("aa", "bb", "cc", "dd", "ee")
# print(t[0:3])
# print(t[::-1])
#
# # 3.长度
# print(len(t))
#
# # 4. in 和 not in
# print('aa' in t)
#
# # 　5.循环
# for x in t:
#     print(x)

# 6.
t = (1, 2, 3, 1, 1, 1, 1, 1, 4)
res = t.index(4)
print(res)

print(t.count(1))
